app/views/bbq/show.html.erb

SELECT  "orders".* FROM "orders" ORDER BY "orders"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
<h1>Thanks for ordering, <%= Order.last.customer %>!</h1>