app/controllers/order_controller.rb

	def show
		puts("------------------- In Show Orders-----------------------")
		@allOrders = Order.all
---
SELECT "orders".* FROM "orders"

	def remove
		puts "------------------- In Remove Orders ---------------------"
  		target = params[:customerName]
  		Order.where(customer: target).destroy_all
---
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 33]]
SELECT "orders".* FROM "orders" WHERE "orders"."customer" = ?  [["customer", "Kevin Lane"]]